Repository: rlabolle/webkpasswd
Catalog: webkpasswd/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Password successfully changed
fr: Mot de passe changé avec succès

source: your administrator
fr: votre administrateur

source: Unknown error code %(code)d
fr: Erreur inconue n°%(code)d

source: Username
fr: Nom d´utilisateur

source: Old password
fr: Ancien mot de passe

source: New password
fr: Nouveau mot de passe

source: Confirm new password
fr: Confirmez le mot de passe

source: Passwords must match
fr: Les mots de passe doivent correspondre

source: Change password
fr: Changer de mot de passe

source: Your account is locked out
fr: Votre compte est vérouillé

source: Old password incorrect
fr: Ancien mot de passe incorrect

source: Unknown username
fr: Nom d´utilisateur inconnu

source: Service unavailable
fr: Service indisponible

source: The new password was rejected by the server
fr: Le nouveau mot de passe a été rejeté par le serveur

source: This password has been seen %(value)d times before in data breaches
fr: Ce mot de passe a été vu %(value)d fois dans des fuites de données

source: Old password incorrect or wrong username
fr: Ancien mot de passe ou nom d'utilisateur incorrect

source: Generaly of the form <strong>firstname.lastname</strong>
fr: Généralement de la forme <strong>prenom.nom</strong>

source: If you forgot your password, please contact <strong>%(contact_email)s</strong>
fr: Si vous avez oublié votre mot de passe, Contactez <strong>%(contact_email)s</strong>

source: Password must:
fr: Le mot de passe doit contenir :

source: Be at least <strong>9 characters</strong>
fr: Au moins <strong>9 characters</strong>

source: And meet 3 of the following requirements:
fr: et respecter au moins 3 des critères suivants :

source: At least <strong>one small letter</strong>
fr: Au moins <strong>une minuscule</strong>

source: At least <strong>one capital letter</strong>
fr: Au moins <strong>une majuscule</strong>

source: At least <strong>one number</strong>
fr: Au moins <strong>un chiffre</strong>

source: At least <strong>one symbol</strong>
fr: Au moins <strong>un symbol</strong>

source: Must match <strong>%(newpassword)s</strong>
fr: Doit correspondre au champ <strong>%(newpassword)s</strong>
